In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("data/House_1_cleaned_named.csv")
df.head()

,Time,Unix,Aggregate,Fridge,Freezer,Washing_Machine,Dishwasher,Computer,Television,Microwave,Kettle,Toaster,active_count
0,2013-10-09 13:06:17,1381323977,523,74,0,69,0,0,0,0,0,1,3
1,2013-10-09 13:07:59,1381324079,561,74,0,69,0,0,0,0,0,1,3
2,2013-10-09 14:11:32,1381327892,445,12,0,71,0,0,0,0,0,1,3
3,2013-10-09 14:19:59,1381328399,613,0,60,70,0,0,0,0,0,1,3
4,2013-10-09 14:20:59,1381328459,536,0,51,70,0,0,0,0,0,1,3

In [3]:
df.shape

(269659, 13)

In [4]:
df['Time'] = pd.to_datetime(df['Time'])
df.set_index('Time', inplace=True)

In [5]:
df.head()

,Unix,Aggregate,Fridge,Freezer,Washing_Machine,Dishwasher,Computer,Television,Microwave,Kettle,Toaster,active_count
Time,,,,,,,,,,,,
2013-10-09 13:06:17,1381323977,523,74,0,69,0,0,0,0,0,1,3
2013-10-09 13:07:59,1381324079,561,74,0,69,0,0,0,0,0,1,3
2013-10-09 14:11:32,1381327892,445,12,0,71,0,0,0,0,0,1,3
2013-10-09 14:19:59,1381328399,613,0,60,70,0,0,0,0,0,1,3
2013-10-09 14:20:59,1381328459,536,0,51,70,0,0,0,0,0,1,3

In [6]:
df['hour'] = df.index.hour
df['day'] = df.index.day
df['weekday'] = df.index.weekday
df['month'] = df.index.month

In [7]:
df[['hour', 'day', 'weekday', 'month']].head()

                     hour  day  weekday  month
Time
2013-10-09 13:06:17    13    9        2     10
2013-10-09 13:07:59    13    9        2     10
2013-10-09 14:11:32    14    9        2     10
2013-10-09 14:19:59    14    9        2     10
2013-10-09 14:20:59    14    9        2     10

In [8]:
appliance_cols = [
    'Fridge', 'Freezer', 'Washing_Machine', 'Dishwasher',
    'Computer', 'Television', 'Microwave', 'Kettle', 'Toaster'
]

In [9]:
df['total_appliance_load'] = df[appliance_cols].sum(axis=1)
df['mean_appliance_load'] = df[appliance_cols].mean(axis=1)
df['max_appliance_load'] = df[appliance_cols].max(axis=1)

In [10]:
df[['total_appliance_load', 'mean_appliance_load', 'max_appliance_load']].head()

,total_appliance_load,mean_appliance_load,max_appliance_load
Time,,,
2013-10-09 13:06:17,144,16.000000,74
2013-10-09 13:07:59,144,16.000000,74
2013-10-09 14:11:32,84,9.333333,71
2013-10-09 14:19:59,131,14.555556,70
2013-10-09 14:20:59,122,13.555556,70

In [11]:
df['lag1'] = df['Aggregate'].shift(1)
df['lag24'] = df['Aggregate'].shift(24)

In [12]:
df['rolling_mean_3'] = df['Aggregate'].rolling(window=3).mean()
df['rolling_mean_24'] = df['Aggregate'].rolling(window=24).mean()

In [13]:
df.dropna(inplace=True)

In [14]:
df.isnull().sum().sum()

np.int64(0)

In [15]:
y = df['Aggregate']
X = df.drop(columns=['Aggregate'])

X.shape, y.shape

((269635, 22), (269635,))

In [16]:
df.to_csv("data/House_1_feature_engineered.csv")